{
  "main": {
    "name":"Chris Dunn",
    "occupation":"Fullstack Developer",
    "description":"who focuses on Voice Skills for Alexa development ",
    "school":"University of Colorado",
    "degree":"",
    "image":"../images/profile-pic.jpg",
    "bio":"I am an entrepreneurially minded developer who believes that technology is about more than bits and bytes. I started my career selling real estate a far cry from developing software, but I've always tried to keep my eye on the future. I firmly believe the future is voice activated devices and I love that I get to help build that everyday. I love exploring what this technology can allow us to do and what it's future might look like. When I'm not doing that, I love endurance sports.",
    "contactmessage":"Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "cdunn@backbayrealtygroup.com",
    "phone": "(860) 463-8361",
    "address":{
      "street":"Beacon Street",
      "city":"Boston",
      "state":"Massachusetts",
      "zip": "02116"
    },
    "website": "http://www.thechrisdunn.com",
    "resumedownload":"https://drive.google.com/file/d/1OJQneuTD6Wac7F_utF0GsyV2n0WiXWWC/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"http://facebook.com/christopher.p.dunn",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com/backbayre",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/christopherpdunn/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/backbayre",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/christopherdunn",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"These are just a few of the technologies that I've worked with",
    "education":[
      {
        "school":"University of Colorado",
        "degree":"History Major",
        "graduated":"August 2004-December 2007",
        "description":"As an undergard I started my first company 'Boulder Junkies' a junk removal service. I was history major but I took a few business school classes as well."
      }
    ],
    "work":[
      {
        "company":"Launch Academy",
        "title":"Full Stack Developer",
        "years":"July 2017 - November 2017",
        "description":"I completed immersive Full Stack Developer bootcamp, which required 50-60 hrs per week of language learning and skill building on both Frontend and Backend software development.  We extensively practiced pair programming, Object Oriented Programming (OOP) and Test Driven Development (TDD). I also actively used TDD on a weekly basis to evaluate and improve programming knowledge."
      },
      {
        "company":"Back Bay Realty Group",
        "title":"Broker Owner",
        "years":"January 2011 - August 2017",
        "description":"I founded a boutique Real Estate brokerage, then hired and trained new agents to become reliable, informative, and successful $100k producers. I also implemented new technologies, such as Wordpress and Hubspot, in order to run the business with an eye on the intersection of real estate and tech."
      },
      {
        "company":"Warren Residential",
        "title":"Agent/CTO",
        "years":"September 2008 - December 2010",
        "description":"Here I implemented G Suite for 40 plus agents. I also did some networking hardware installations."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "description":"I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image":"git.jpg"
      },
      {
        "name":"React Js",
        "description":"React was the javascript framework I learned in my bootcamp program and I’ve gone on to use in most of my projects. I’ve really loved using it for JAMstack projects. I love the build it once and use it again and again aspect.",
        "image":"react.jpg"
      },
      {
        "name":"Ruby",
        "description":"Ruby was the first language I learned and Rails obviously provides one of the quickest ways to quickly scale up a new site. I’ve done a few projects that used Ruby for the backend.",
        "image":"ruby.png"
      },
      {
        "name":"PostgreSQL",
        "description":"For the projects that I’ve worked on thus far, relational databases have been the best use case. I look forward to the opportunity to work on projects that use NoSQL structure in the future so I can expand my horizons.",
        "image":"Postgresql.png"
      },
      {
        "name":"Node JS",
        "description":"Node JS has been something I’ve come into while building my Alexa skills as this is my primary scripting language for my lambda functions.",
        "image":"node.jpg"
      },

      {
        "name":"SSML",
        "description":"When you work with Voice Skills, SSML allows you to create incredible user experiences. I believe this langauge will grow tremendously in popularity over the next few years.",
        "image":"alexa.png"
      },
      {
        "name":"Bootstrap 4",
        "description":"I've used bootstrap on a few projects as it's more widely used than foundation which I used on my first couple of projects.",
        "image":"bootstrap.jpg"
      },
      {
        "name":"Heroku",
        "description":"I've used Heroku as my hosting platform for my fullstack applications. The ability to quickly deploy from Github makes it a wonderful platform to work with.",
        "image":"heroku.jpg"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Buff Trivia",
        "category":"Trivia Skill for Alexa based on the University of Colorado",
        "image":"alexa.jpg",
        "url":"https://www.buffstrivia.com"
      },
      {
        "title":"2020 Meme-Maker",
        "category":"React app that allows users to create meme's of 2020 presidential candidates",
        "image":"meme-maker.png",
        "url":"http://www.2020mememaker.com"
      },
      {
        "title":"Farina Roofing",
        "category":"Portfolio Website I built for a roofing company.",
        "image":"farina2.png",
        "url":""
      },
      {
        "title":"iTunes Music Charts",
        "category":"A react based itunes styled itunes chart. Uses iTunes API to display downloads",
        "image":"itunes-charts.png",
        "url":"https://itunesmusiccharts.com/"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Coming Soon",
        "user":""
      }
    ]
  }
}
